// Введение в C#. Урок 3. Практическое задание 3.
// Написать программу, выводящую введенную пользователем строку в обратном порядке (olleH вместо Hello).

using System;

namespace Exercise_3_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Написать программу, выводящую введенную пользователем строку в обратном порядке (olleH вместо Hello).");
        }
    }
}
