// Введение в C#. Урок 6. Практическое задание 1.
// Написать консольное приложение Task Manager, которое выводит на экран
// запущенные процессы и позволяет завершить указанный процесс.
// Предусмотреть возможность завершения процессов с помощью указания его ID или имени процесса

using System;

namespace Exercise_6_1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Написать консольное приложение Task Manager");
        }
    }
}
