// Введение в C#. Урок 4. Практическое задание 2.
// Написать программу, принимающую на вход строку — набор чисел, разделенных пробелом,
// и возвращающую число — сумму всех чисел в строке. Ввести данные с клавиатуры и вывести результат на экран.

using System;

namespace Exercise_4_2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Написать программу, принимающую на вход строку — набор чисел, разделенных пробелом");
        }
    }
}
