// Введение в C#. Урок 4. Практическое задание 4.
// Написать программу, вычисляющую число Фибоначчи для заданного значения рекурсивным способом.

using System;

namespace Exercise_4_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Написать программу, вычисляющую число Фибоначчи для заданного значения рекурсивным способом.");
        }
    }
}
