// Алгоритмы. Урок 7. Задание 1

// Задача о рюкзаке (решил разобрать эту задачу)
// Емкость вашего рюкзака составляет 6 фунтов,
// Вы можете взять предметы из следующего списка.
// У каждого предмета имеется стоимость, чем она выше, тем важнее предмет:
// вода, 3 фунта, 10; 
// книга, 1 фунт, 3;
// еда, 2 фунта, 9;
// куртка, 2 фунта, 5;
// камера, 1 фунт, 6 
// Как выглядит оптимальный набор предметов для похода?

using System;

namespace Exercise_7_1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Задача о рюкзаке");
        }
    }
}
