// Алгоритмы. Урок 1. Задание 2
// Реализуйте функцию вычисления числа Фибоначчи
// Требуется реализовать рекурсивную версию и версию без рекурсии (через цикл).


using System;

namespace Exercise_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Функция вычисления числа Фибоначчи");
        }
    }
}
