// Введение в C#. Урок 3. Практическое задание 1.
// Написать программу, выводящую элементы двухмерного массива по диагонали.

using System;

namespace Exercise_3_1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Написать программу, выводящую элементы двухмерного массива по диагонали.");
        }
    }
}
