// Напишите на C# функцию согласно блок-схеме
// Требуется реализовать на C# функцию согласно блок-схеме. Блок-схема описывает алгоритм проверки,
// простое число или нет.


using System;

namespace Exercise_1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("функция согласно блок-схеме");
        }
    }
}
